package examples01.day1;

/**
 * @author Nikolay Pavlov
 *
 * Вывести слово на экран "JAVA", в столбик, чтобы оно повторилось 10 раз, используя любой цикл
 */

public class Task3 {
    public static void main(String[] args) {

        for (int i = 0; i < 10; i++) {
            System.out.println("JAVA");
        }
    }
}
